In this practicum, we are using MySQL and python to load a practical data file from the IMDB website and manipulate the data to designed tables. Also we built infrastructure for an application. With the built database, we created triggers, secure views, indexes, transactions, and complex queries.

In [1]:
#install the mysql connector: pip install mysql-connector-python
import mysql.connector
from mysql.connector import Error
from mysql.connector import errorcode
import tarfile
import pandas as pd
import datatable as dt
import numpy as np
from itertools import chain
from sqlalchemy import create_engine
import pymysql

import os
import pandas as pd

In [2]:
# This function is used to define SQLconnection
def create_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("Connection to MySQL DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [3]:
# This function is used to parse the column with multipe values and convert them into rows
def flatten_columns(df, col_toflat, index_coln, new_col_name, new_id_name):
    """https://medium.com/@sureshssarda/pandas-splitting-exploding-a-column-into-multiple-rows-b1b1d59ea12e
    works for the case when columns is value1, value2,... """ 
    df = df.loc[df[col_toflat] != "\\N"].dropna(subset=[col_toflat])
    flattened_df = pd.DataFrame(df[col_toflat].str.split(',').values.tolist(), index = df[index_coln]).stack()
    flattened_df = flattened_df.reset_index()[[0, index_coln]] 
    flattened_df.columns = [new_col_name, new_id_name] # renaming
    return flattened_df

## Task 2

### 2.A Create a ERD model in Crow's Foot
create a data model in the form of an ERD in Crow's Foot notation using a tool of your choice (e.g., LucidChart, TOAD, MySQL Workbench, etc.) and embed an image of the model in your notebook.

![ERD with original file tables](pics\2A_ER.png)

With the information provided from https://www.imdb.com/interfaces/, we generate a ER diagram for origianl data. In this diagram, there are some many-to-many relations and multi-valued attributes which will be normalized in 2.B

### 2.B Create a ERD model with normalized tables
Add junction/association tables to normalize many-to-many relationships, normalize multi-valued attributes, and create lookup tables for categorical attribute values. Embed an updated image of the model in your notebook.

![ERD with normalized tables](pics\2B_ER.png)

For table TitleCrew, we split it into two table TitleCrewWriter, TitleCrewDirector and deal with multi-values by process the data. Similarily, we deal with multi-values in TitlePrincipals Characters Columns, KnownForTitles in NameBasics, attributes and types in TitleBasics.

### 2.C Add two calculated columns
add two new attributes (columns) to the appropriate tables: one for the age of a person and one for the number of movies a person has appeared in. Embed an updated image of the model in your notebook. Leave those columns empty for now. They will be filled in later.

![ERD with added columns](pics\2C_ER.png)

Two columns: age and number of movieds are added in NameBasics table as two calculated columns
Those two columns are empty when we importing the data, and will be updated in the Task 5

### 2.D Ensure that the relational model is in at least BCNF
ensure that the relational model is in at least BCNF, except for the columns added in step 2C.  In your notebook, answer: Why would someone choose to denormalize data as done in 2C?  ("Because the assignment told us to" is not a deep enough answer.)

Proof of BCNF:
<br>
All columns in tables are only have one value inside
<br>
1. TitleBasics : tb_tconst is the unique identifier of the title. Other non-primary attributes also are not depends on each other.
<br>
2. TitleAKA: idTitleAKA is the id created as PK. Only PK is dependents on other attribtues
<br>
3. NameBasics: nb_nconst is the unique identifier of the name/person.Only PK is dependents on other attribtues
<br>
4. TitleCrewWriter: idTitleCrewcol is the id created as PK. Only PK is dependents on other attribtues
<br>
5. TitleCrewDirector: idTitleCrewDirector is the id created as PK. Only PK is dependents on other attribtues
<br>
6. TitleEpisode: idTitleEpisode is the id created as PK. idTitleEpisode-> (te_tconst, seasonNumber, episodeNumber)
<br>
7. TitlePrincipals: idTitlePrincipals is the id created as PK. idTitleEpisode-> (tp_tconst, tp_ordering, tp_nconst)
<br>
8. TitleRating: tr_tconst is the unique identifier of the title. It should be subset of the tb_tconst
9. TitleAkaAttribute: idTitleAkaAttributes is the id created as PK. Only PK is dependents on other attribtues
<br>
10. KnownForTitles： idNameTitle is the id created as PK. Only PK is dependents on other attribtues
<br>
11. TitleAkaType：idTitleAkaType is the id created as PK. Only PK is dependents on other attribtues
<br>
12. PrincipalsCharacters：idPrincipalsCharacters is the id created as PK. Only PK is dependents on other attribtues

The reason we add two new attributes as 2C is to make the information more convient for usages. Instead of birth year, age is more straightforward. Also the number of movies one perspn has appeared in is the another key information when we try to know the basic information of a person. Both information will be often queried by users. Adding these attributes will increase the efficiency of the query.

## Task 3
Create and then run CREATE TABLE statements to build the schema. These statements must run from within your notebook and not from a separate script. Ensure proper referential integrity.

###  Read Stored Database

You can directly use the processed database for task 5-12 instead of running code in task 3 and 4. All formatted or processed data are store in sharefolder https://northeastern-my.sharepoint.com/:f:/g/personal/peng_x_northeastern_edu/ElLaPMZ1PhtPuxq1pI0CzmgBA0YA_KWxn4n7rt28Ri9d3Q?e=C6vnxT

The stored database can be created by running sql namded as FinalPrac2DB.sql in sharefolder https://northeastern-my.sharepoint.com/:u:/g/personal/peng_x_northeastern_edu/EYJGTV6PCT1Ch2ijTjTl3O0BbWtfgzdgLWVS31cDV28UdQ?e=VpEr1h 

Importing stored Database with MySQL workbench: 
1. open one of your local MYSQL Connections 
2. run sql script
3. set default schema name: practicum 2, default character set: utf8

The importing process will last for few hours. Please use fill out your connection info in the next cell.

engine =  mysql.connector.connect(user='root', password='',
                              host='127.0.0.1',
                              database='practicum2')
db_cursor = engine.cursor()

###  Creating Database and Tables

In [ ]:
#make connection
connection = create_connection("localhost", "root", "*********")
# creating database_cursor to perform SQL operation
db_cursor = connection.cursor()
# executing cursor with execute method and pass SQL query
db_cursor.execute("CREATE DATABASE practicum2")

In [ ]:
#define the code for creating tables
TABLES = {}

TABLES['TitleBasics'] = (
" CREATE TABLE `TitleBasics` ("
  "`tb_tconst` VARCHAR(500) NOT NULL,"
  "`titleType` VARCHAR(500) NULL,"
  "`primaryTitle` VARCHAR(500) NULL,"
  "`originalTitle` VARCHAR(500) NULL,"
  "`isAdult` TINYINT NULL,"
  "`startYear` CHAR(4) NULL,"
  "`endYear` CHAR(4) NULL,"
  "`runtimeMinutes` INT NULL,"
  "`genres1` VARCHAR(500) NULL,"
  "`genres2` VARCHAR(500) NULL,"
  "`genres3` VARCHAR(500) NULL,"
  " PRIMARY KEY (`tb_tconst`)"
  " )ENGINE = InnoDB")

TABLES['TitleAKA'] = (
  " CREATE TABLE `TitleAKA` ("
  "`idTitleAKA` INT NOT NULL,"
  "`titleID` VARCHAR(500) NULL,"
  "`ordering` INT NULL,"
  "`title` VARCHAR(1000) NULL,"
  "`region` VARCHAR(500) NULL,"
  "`IsOriginalTitle` VARCHAR(5) NULL,"
  "`language` VARCHAR(20) NULL,"    
  " PRIMARY KEY (`idTitleAKA`),"
  " INDEX `tb_tconst_idx` (`titleID` ASC),"
  " CONSTRAINT `taka_tb_tconst`"
  "   FOREIGN KEY (`titleID`) REFERENCES  `TitleBasics` (`tb_tconst`)"
  "   ON DELETE NO ACTION"
  "   ON UPDATE NO ACTION"
  " )ENGINE = InnoDB")

TABLES['NameBasics'] = (
  " CREATE TABLE `NameBasics` ("
  "`nb_nconst` VARCHAR(500) NOT NULL,"
  "`primaryName` VARCHAR(500) NULL,"
  "`birthYear` CHAR(4) NULL,"
  "`deathYear` CHAR(4) NULL,"
  "`primaryProfession1` VARCHAR(500) NULL,"
  "`primaryProfession2` VARCHAR(500) NULL,"
  "`primaryProfession3` VARCHAR(500) NULL,"
  "`age` INT NULL,"
  "`numberOfMovies` INT NULL,"
  " PRIMARY KEY (`nb_nconst`)"
  " )ENGINE = InnoDB")

TABLES['TitleCrewWriter'] = (
  " CREATE TABLE `TitleCrewWriter` ("
  "`idTitleCrewcol` INT NOT NULL,"
  "`tcw_tconst` VARCHAR(500) NOT NULL,"
  "`writers` VARCHAR(500) NULL,"
  " PRIMARY KEY (`idTitleCrewcol`),"
  " INDEX `nb_nconst_idx` (`writers` ASC),"
  " CONSTRAINT `tcw_tb_tconst`"
  "  FOREIGN KEY (`tcw_tconst`)"
  "  REFERENCES `TitleBasics` (`tb_tconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION,"
  " CONSTRAINT `tcw_nb_nconst`"
  "  FOREIGN KEY (`writers`)"
  "  REFERENCES `NameBasics` (`nb_nconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION"
  " )ENGINE = InnoDB")

TABLES['TitleCrewDirector'] = (
  "  CREATE TABLE `TitleCrewDirector` ("
  "`idTitleCrewDirector` INT NOT NULL,"
  "`tcd_tconst` VARCHAR(500) NOT NULL,"
  "`director` VARCHAR(500) NOT NULL,"
  " PRIMARY KEY (`idTitleCrewDirector`),"
  " INDEX `tb_tconst_idx` (`tcd_tconst` ASC),"
  " INDEX `nb_nconst_idx` (`director` ASC),"
  " CONSTRAINT `tcd_tb_tconst`"
  "   FOREIGN KEY (`tcd_tconst`)"
  "   REFERENCES `TitleBasics` (`tb_tconst`)"
  "   ON DELETE NO ACTION "
  "   ON UPDATE NO ACTION,"
  " CONSTRAINT `tcd_nb_nconst`"
  "   FOREIGN KEY (`director`)"
  "   REFERENCES  `NameBasics` (`nb_nconst`)"
  "   ON DELETE NO ACTION"
  "   ON UPDATE NO ACTION"
  " )ENGINE = InnoDB")
    
    
TABLES['TitleEpisode'] = (
  "  CREATE TABLE `TitleEpisode` ("
  "`idTitleEpisode` INT NOT NULL,"
  "`te_tconst` VARCHAR(500) NULL,"
  "`parentTconst` VARCHAR(500) NULL,"
  "`seasonNumber` INT NULL,"
  "`episodeNumber` INT NULL,"
  "PRIMARY KEY (`idTitleEpisode`),"
  "INDEX `tb_tconst_idx` (`te_tconst` ASC),"
  "INDEX `tb_tconst_idx1` (`parentTconst` ASC),"
  "CONSTRAINT `te_tb_tconst`"
  "  FOREIGN KEY (`te_tconst`)"
  "  REFERENCES  `TitleBasics` (`tb_tconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION,"
  "CONSTRAINT `te2_tb_tconst`"
  "  FOREIGN KEY (`parentTconst`)"
  "  REFERENCES  `TitleBasics` (`tb_tconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION"
  ")ENGINE = InnoDB")

TABLES['TitlePrincipals'] = (
  "CREATE TABLE `TitlePrincipals` ("
  "`idTitlePrincipals` INT NOT NULL,"
  "`tp_tconst` VARCHAR(500) NOT NULL,"
  "`tp_ordering` VARCHAR(500) NULL,"
  "`tp_nconst` VARCHAR(500) NOT NULL,"
  "`category` VARCHAR(500) NULL,"
  "`job` VARCHAR(500) NULL,"
  "PRIMARY KEY (`idTitlePrincipals`),"
  "INDEX `tb_tconst_idx` (`tp_tconst` ASC),"
  "INDEX `nb_nconst_idx` (`tp_nconst` ASC),"
  "CONSTRAINT `tb_tconst`"
  "  FOREIGN KEY (`tp_tconst`)"
  "  REFERENCES  `TitleBasics` (`tb_tconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION,"
  "CONSTRAINT `nb_nconst`"
  "  FOREIGN KEY (`tp_nconst`)"
  "  REFERENCES  `NameBasics` (`nb_nconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION"
  ")ENGINE = InnoDB")
    
TABLES['TitleRating'] = (
  "CREATE TABLE `TitleRating` ("
  "`tr_tconst` VARCHAR(500) NOT NULL,"
  "`averageRating` FLOAT NULL,"
  "`numVotes` INT NULL,"
  "PRIMARY KEY (`tr_tconst`),"
  "CONSTRAINT `tr_tb_tconst`"
  "  FOREIGN KEY (`tr_tconst`)"
  "  REFERENCES  `TitleBasics` (`tb_tconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION"
  ")ENGINE = InnoDB")
    
    
TABLES['TitleAkaAttribute'] = (
  "CREATE TABLE `TitleAkaAttribute` ("
  "`idTitleAkaAttributes` INT NOT NULL,"
  "`taa_idAKA` INT NOT NULL,"
  "`taa_attribute` VARCHAR(100) NULL,"
  "PRIMARY KEY (`idTitleAkaAttributes`),"
  "INDEX `idTitleAKA_idx` (`taa_idAKA` ASC),"
  "CONSTRAINT `idTitleAKA`"
  "  FOREIGN KEY (`taa_idAKA`)"
  "  REFERENCES `TitleAKA` (`idTitleAKA`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION"
  ")ENGINE = InnoDB")
    
    
TABLES['KnownForTitles'] = (
  "CREATE TABLE `KnownForTitles` ("
  "`idNameTitle` INT NOT NULL,"
  "`kt_nconst` VARCHAR(500) NULL,"
  "`kt_tconst` VARCHAR(500) NULL,"
  "PRIMARY KEY (`idNameTitle`),"
  "INDEX `nb_nconst_idx` (`kt_nconst` ASC),"
  "INDEX `tb_tconst_idx` (`kt_tconst` ASC),"
  "CONSTRAINT `knt_tb_tconst`"
  "  FOREIGN KEY (`kt_tconst`)"
  "  REFERENCES  `TitleBasics` (`tb_tconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION,"
  "CONSTRAINT `knt_nb_nconst`"
  "  FOREIGN KEY (`kt_nconst`)"
  "  REFERENCES  `NameBasics` (`nb_nconst`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION"
  ")ENGINE = InnoDB")
    

TABLES['TitleAkaType'] = (
  "CREATE TABLE `TitleAkaType` ("
  "`idTitleAkaType` INT NOT NULL,"
  "`tat_idAKA` INT NULL,"
  "`type` ENUM('alternative', 'dvd', 'festival', 'tv', 'video', 'working', 'original', 'imdbDisplay') NULL,"
  "PRIMARY KEY (`idTitleAkaType`),"
  "INDEX `idTitleAKA_idx` (`tat_idAKA` ASC),"
  "CONSTRAINT `taa_idTitleAKA`"
  "  FOREIGN KEY (`tat_idAKA`)"
  "  REFERENCES `TitleAKA` (`idTitleAKA`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION"
  ")ENGINE = InnoDB")
    
    
TABLES['PrincipalsCharacters'] = (
  "CREATE TABLE `PrincipalsCharacters` ("
  "`idPrincipalsCharacters` INT NOT NULL,"
  "`pc_idTitlePrincipals` INT NULL,"
  "`character` VARCHAR(500) NULL,"
  "PRIMARY KEY (`idPrincipalsCharacters`),"
  "INDEX `idTitlePrincipals_idx` (`pc_idTitlePrincipals` ASC),"
  "CONSTRAINT `idTitlePrincipals`"
  "  FOREIGN KEY (`pc_idTitlePrincipals`)"
  "  REFERENCES  `TitlePrincipals` (`idTitlePrincipals`)"
  "  ON DELETE NO ACTION"
  "  ON UPDATE NO ACTION"
  ")ENGINE = InnoDB")

In [ ]:
for table_name in TABLES:
    table_description = TABLES[table_name]
    try:
        print("Creating table {}: ".format(table_name), end='')
        db_cursor.execute(table_description)
    except mysql.connector.Error as err:
        if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
            print("already exists.")
        else:
            print(err.msg)
    else:
        print("OK")

In [ ]:
# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw="*********",
                               db="practicum2"))

## Task 4 Load the data
Load the data from the downloaded data files into the tables. Properly parse the foreign keys and attributes and ensure that the data is in the right tables in the right form and that referential integrity is ensured. This will require parsing code in your chosen programming language. You should create a subset of each dataset for testing (as the data sets are very large and take significant time to load). What is the effect of the referential integrity checking while you load? Can you do something about that? Describe and implement any improvement strategies.

### 4.1 Read downloaded files

In [4]:
path = os.getcwd()
path = r'/prac2 data' # select your data path
save_path = r'/formatted' # select your data path for processed data
name_basics_file = 'name.basics.tsv.gz'
title_aks_file = 'title.akas.tsv.gz'
title_basics_file = 'title.basics.tsv.gz'
title_crew_file = 'title.crew.tsv.gz'
title_episode_file = 'title.episode.tsv.gz'
title_principals_file = 'title.principals.tsv.gz'
title_rating_file = 'title.ratings.tsv.gz'

In [ ]:
name_basic = dt.fread(os.path.join(path, name_basics_file), fill=True).to_pandas()
title_basic =  dt.fread(os.path.join(path, title_basics_file),fill=True).to_pandas()
aka =  dt.fread(os.path.join(path, title_aks_file),fill=True).to_pandas()
crew = dt.fread(os.path.join(path, title_crew_file),fill=True).to_pandas()
episode = dt.fread(os.path.join(path, title_episode_file),fill=True).to_pandas()
principals = dt.fread(os.path.join(path, title_principals_file),fill=True).to_pandas()
ratings = dt.fread(os.path.join(path, title_rating_file),fill=True).to_pandas()

### 4.2  Process tables for designed schema

#### Table: Title Basics

We separate original "genres" column into three new columns by str.split, and to make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
#split the genres column into three new columns
titlegenres = TitleBasic['genres'].str.split(',', 3, expand=True)
titlegenre = titlegenres.rename(columns={ 0: 'genres1', 1:'genres2', 2:'genres3'})
TitleBasic = TitleBasic.drop(['genres'], axis=1)
TitleBasic = pd.concat([TitleBasic, titlegenre], axis=1)

#TitleBasic dataframe format, replace all the '\N' into np.nan
TitleBasic = TitleBasic.replace({r'\\N': np.nan}, regex=True)
TitleBasics=TitleBasic.rename(columns={'tconst': 'tb_tconst'})
TitleBasics.to_csv(os.path.join(save_path, 'TitleBasics.csv.gz'),  compression='gzip')

In [8]:
TitleBasics.head()

,tb_tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres1,genres2,genres3
0,tt0000001,short,Carmencita,Carmencita,False,1894.0,NaN,1.0,Documentary,Short,
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,False,1892.0,NaN,5.0,Animation,Short,
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,False,1892.0,NaN,4.0,Animation,Comedy,Romance
3,tt0000004,short,Un bon bock,Un bon bock,False,1892.0,NaN,12.0,Animation,Short,
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,False,1893.0,NaN,1.0,Comedy,Short,

#### Table:  Name Basics

We separate original "primaryProfession" column into three new columns by str.split, and to make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
#split the primaryprofession column into three new columns
pripros = NameBasic['primaryProfession'].str.split(',', 3, expand=True)
pripro = pripros.rename(columns={ 0: 'primaryProfession1', 1:'primaryProfession2', 2:'primaryProfession3'})
NameBasic = NameBasic.drop(['primaryProfession'], axis=1)
NameBasic = pd.concat([NameBasic, pripro], axis=1)

#drop knownfortitles column
NameBasics = NameBasic.drop('knownForTitles', axis=1)
#rename the column
NameBasics = NameBasics.rename(columns={ 'nconst': 'nb_nconst'})
#replace all the /N into np.nan
NameBasics = NameBasics.replace({r'\\N': np.nan}, regex=True)
NameBasics.to_csv(os.path.join(save_path, 'NameBasics.csv.gz'),  compression='gzip')

In [10]:
NameBasics.head()

,nb_nconst,primaryName,birthYear,deathYear,primaryProfession1,primaryProfession2,primaryProfession3
0,nm0000001,Fred Astaire,1899.0,1987.0,soundtrack,actor,miscellaneous
1,nm0000002,Lauren Bacall,1924.0,2014.0,actress,soundtrack,
2,nm0000003,Brigitte Bardot,1934.0,NaN,actress,soundtrack,music_department
3,nm0000004,John Belushi,1949.0,1982.0,actor,soundtrack,writer
4,nm0000005,Ingmar Bergman,1918.0,2007.0,writer,director,actor

#### Table:  Title Crew Director

This dataset comes from the "TitleCrew" dataset. In reality, there might be multiple directors participating for one product, therefore, to map this many-to-many or many-to-one relationship, we use the flatten function which has been defined at beginning to process the original "titlecrew" table. To make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
# create table title crew director
TitleCrewDirector = flatten_columns(crew, 'directors', 'tconst', 'director', 'tcd_tconst')
TitleCrewDirector.to_csv('TitleCrewDirector.csv.gz', compression='gzip')
TitleCrewDirector = dt.fread('TitleCrewDirector.csv.gz',fill=True).to_pandas()

#change the order
TitleCrewDirector = TitleCrewDirector[['C0','C2','C1']]

#rename the columns
TitleCrewDirector = TitleCrewDirector.rename(columns={'C0':'idTitleCrewDirector','C2':'tcd_tconst','C1':'director'})

#Drop the first row
TitleCrewDirector = TitleCrewDirector.drop(TitleCrewDirector.index[0])

#replace all the /N into np.nan
TitleCrewDirector = TitleCrewDirector.replace({r'\\N': np.nan}, regex=True)

#make the first id column to be integer
TitleCrewDirector['idTitleCrewDirector'] = TitleCrewDirector['idTitleCrewDirector'].round(0).astype(int)
TitleCrewDirector.to_csv(os.path.join(save_path, 'TitleCrewDirector.csv.gz'),  compression='gzip')

In [12]:
TitleCrewDirector.head()

   idTitleCrewDirector tcd_tconst   director
0                    0  tt0000001  nm0005690
1                    1  tt0000002  nm0721526
2                    2  tt0000003  nm0721526
3                    3  tt0000004  nm0721526
4                    4  tt0000005  nm0005690

#### Table:  Title Crew Writer

This dataset comes from the "TitleCrew" dataset too. For similar reason as we given in "TitleCrewDirector" dataset, we use the flatten function which has been defined at beginning to process the original "titlecrew" table to map the many-to-many or one-to many relationship between product and writer. To make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
# create table title crew writer
TitleCrewWriter = flatten_columns(crew, 'writers', 'tconst', 'writer', 'tcw_tconst')
TitleCrewWriter.to_csv('TitleCrewWriter.csv.gz', compression='gzip')
TitleCrewWriter = dt.fread('TitleCrewWriter.csv.gz',fill=True).to_pandas()

#change the order
TitleCrewWriter = TitleCrewWriter[['C0','C2','C1']]

#rename the columns
TitleCrewWriter = TitleCrewWriter.rename(columns={'C0':'idTitleCrewcol','C2':'tcw_tconst','C1':'writers'})

#Drop the first row
TitleCrewWriter = TitleCrewWriter.drop(TitleCrewWriter.index[0])

#replace all the /N into np.nan
TitleCrewWriter = TitleCrewWriter.replace({r'\\N': np.nan}, regex=True)

#make the first id column to be integer
TitleCrewWriter['idTitleCrewcol'] = TitleCrewWriter['idTitleCrewcol'].round(0).astype(int)
TitleCrewWriter.to_csv(os.path.join(save_path, 'TitleCrewWriter.csv.gz'),  compression='gzip')

In [14]:
TitleCrewWriter.head()

   idTitleCrewcol tcw_tconst    writers
0               0  tt0000009  nm0085156
1               1  tt0000036  nm0410331
2               2  tt0000076  nm0410331
3               3  tt0000091  nm0617588
4               4  tt0000108  nm0410331

#### Table:  Title AKA Attribute

This dataset comes from the "TitleAKA" dataset. In reality, there might be multiple names or titles while movies are issued in various countris or areas, therefore, to map this many-to-many or many-to-one relationship, we use the flatten function which has been defined at beginning to process the original TitleAKA table. To make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
# create table for titleAKA_attribute
df = aka.reset_index()
df_t = df.loc[df['types'] != "\\N"].dropna(subset=['types'])
flattened_df = pd.DataFrame(df_t['types'].str.split('\x02').values.tolist(), index = df_t['index']).stack()
title_aks_attributes_df = flattened_df.reset_index()[[0, 'index']] 
title_aks_attributes_df.columns = ['type', 'tat_idAKA'] # renaming
title_aks_attributes_df.to_csv('TitleAkaAttribute.csv.gz',  compression='gzip')

#change the order
TitleAkaAttribute = TitleAkaAttribute[['C0', 'taa_idAKA','attribute']]

#rename the columns
TitleAkaAttribute = TitleAkaAttribute.rename(columns={'C0':'idTitleAkaAttributes','attribute':'taa_attribute'})

#replace all the /N into np.nan
TitleAkaAttribute = TitleAkaAttribute.replace({r'\\N': np.nan}, regex=True)
TitleAkaAttribute.to_csv(os.path.join(save_path, 'TitleAkaAttribute.csv.gz'),  compression='gzip')

In [16]:
TitleAkaAttribute.head()

   idTitleAkaAttributes  taa_idAKA          taa_attribute
0                     0          1          literal title
1                     1         11          literal title
2                     2         14  literal English title
3                     3         24          literal title
4                     4         26          literal title

#### Table:  Title AKA Type

This "type" dataset comes from the "TitleAKA" dataset. In reality, there might be various types while the movie are issued, therefore, to map this many-to-many or many-to-one relationship, we use the flatten function which has been defined at beginning to process the original TitleAKA table. To make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
df = aka.reset_index()
TitleAkaType = flatten_columns(df, 'types', 'index', 'type', 'tat_idAKA')
TitleAkaType.to_csv('TitleAkaType.csv.gz',  compression='gzip')
TitleAkaType = dt.fread('TitleAkaType.csv.gz',fill=True).to_pandas()

#change the order
TitleAkaType = TitleAkaType[['C0', 'tat_idAKA','type']]

#rename the columns
TitleAkaType = TitleAkaType.rename(columns={'C0':'idTitleAkaType'})

#replace all the /N into np.nan
TitleAkaType = TitleAkaType.replace({r'\\N': np.nan}, regex=True)
TitleAkaType.to_csv(os.path.join(save_path, 'TitleAkaType.csv.gz'),  compression='gzip')

In [19]:
TitleAkaType.head()

   idTitleAkaType  tat_idAKA         type
0               0          0  imdbDisplay
1               1          2  imdbDisplay
2               2          3  imdbDisplay
3               3          4  imdbDisplay
4               4          6     original

#### Table:  Title Principals Characters

This dataset is comes from "TitlePrincipals" dataset, a person may play multple roles in the same movie, therefore, the values for "character" column having multiple values in some rows. We separate one cell by string function and generate different rows while each row represents for one character. This makes sure the database fits for BCNF. Also the empty cells are transferred into np.nan and rename/reorder operations are given to make sure the dataframe can be load into database successfully.

In [ ]:
# create table for titlePrincicleCharacters
principals['characters'] = principals['characters'].str.lstrip('[').str.rstrip(']').str.replace('"','')
df = title_principals_df[['characters']].reset_index()
PrincipalsCharacters = flatten_columns(df, 'characters', 'index', 'character', 'pc_idTitlePrincipals')
PrincipalsCharacters.to_csv('TitlePrincipalsCharacters.csv.gz',  compression='gzip')
PrincipalsCharacters = dt.fread('PrincipalsCharacters.csv.gz',fill=True).to_pandas()

#change the order
PrincipalsCharacters = PrincipalsCharacters[['C0', 'pc_idTitlePrincipals','character']]

#rename the columns
PrincipalsCharacters = PrincipalsCharacters.rename(columns={'C0':'idPrincipalsCharacters'})

#replace all the /N into np.nan
PrincipalsCharacters = PrincipalsCharacters.replace({r'\\N': np.nan}, regex=True)
PrincipalsCharacters.to_csv(os.path.join(save_path, 'PrincipalsCharacters.csv.gz'),  compression='gzip')

In [21]:
PrincipalsCharacters.head()

,idPrincipalsCharacters,pc_idTitlePrincipals,character
0,0,0,Self
1,1,11,Blacksmith
2,2,12,Assistant
3,3,21,Sneezing Man
4,4,24,Miss Geraldine Holbrook (Miss Jerry)

#### Table:  Title Principals

We delete the "characters" column from this dataset as the "characters" infromation is given in the "PrincipalCharacters" dataset. And empty cells are transferred into np.nan and rename/reorder operations are given to make sure the dataframe can be load into database successfully.

In [ ]:
#add the id to Principals
Principal.reset_index(level=0, inplace=True)
#drop character column
TitlePrincipals = Principal.drop('characters', axis=1)
#rename columns 
TitlePrincipals = TitlePrincipals.rename(columns={ 'index': 'idTitlePrincipals', 'tconst':'tp_tconst', 'ordering':'tp_ordering','nconst':'tp_nconst'})
#replace all the /N into np.nan
TitlePrincipals = TitlePrincipals.replace({r'\\N': np.nan}, regex=True)
#remove the rows do not contains in the primary table NameBasics
TitlePrincipals = TitlePrincipals.loc[TitlePrincipals.tp_nconst.isin(NameBasics.nb_nconst)]

#remove the rows do not contains in the primary table TitleBasics
TitlePrincipals = TitlePrincipals.loc[TitlePrincipals.tp_tconst.isin(TitleBasic.tb_tconst)]
TitlePrincipals.to_csv(os.path.join(save_path, 'TitlePrincipals.csv.gz'),  compression='gzip')

In [27]:
TitlePrincipals.head()

,idTitlePrincipals,tp_tconst,tp_ordering,tp_nconst,category,job
0,0,tt0000001,1,nm1588970,self,
1,1,tt0000001,2,nm0005690,director,
2,2,tt0000001,3,nm0374658,cinematographer,director of photography
3,3,tt0000002,1,nm0721526,director,
4,4,tt0000002,2,nm1335271,composer,

#### Table: TitleEpisode

To make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
#add the index as keys
Episode.reset_index(level=0, inplace=True)
#replace all the /N into np.nan
Episode = Episode.replace({r'\\N': np.nan}, regex=True)
#rename the columns
TitleEpisode = Episode.rename(columns={ 'index': 'idTitleEpisode', 'tconst':'te_tconst'})
#froeign key check
#remove the rows do not contains in the primary table TitleBasics
TitleEpisode = TitleEpisode.loc[TitleEpisode.parentTconst.isin(TitleBasics.tb_tconst)]

TitleEpisode = TitleEpisode.loc[TitleEpisode.te_tconst.isin(TitleBasics.tb_tconst)]
TitleEpisode.to_csv(os.path.join(save_path, 'TitleEpisode.csv.gz'),  compression='gzip')

In [29]:
TitleEpisode.head()

   idTitleEpisode  te_tconst parentTconst  seasonNumber  episodeNumber
0               0  tt0041951    tt0041038           1.0            9.0
1               1  tt0042816    tt0989125           1.0           17.0
2               2  tt0042889    tt0989125           NaN            NaN
3               3  tt0043426    tt0040051           3.0           42.0
4               4  tt0043631    tt0989125           2.0           16.0

#### Table: TitleAKA

We delete "types" and "attributes" columns from original "titleAKA" dataset as both columns' information have been given in "TitleAKATypes" and "TitleAKAattributes" datasets. After deletion, empty cells are transferred into np.nan and rename/reorder operations are given to make sure the dataframe can be load into database successfully.

In [ ]:
#Drop the columns
TitleAka = Aka.drop('types', axis=1)
TitleAka = TitleAka.drop('attributes', axis=1)
#add the index
TitleAka.reset_index(level=0, inplace=True)
#replace all the /N into np.nan
TitleAka = TitleAka.replace({r'\\N': np.nan}, regex=True)
#rename the columns
TitleAka = TitleAka.rename(columns={ 'index': 'idTitleAKA', 'titleId':'titleID'})
#froeign key check
#remove the rows do not contains in the primary table TitleBasics
TitleAKA = TitleAka.loc[TitleAka.titleID.isin(TitleBasics.tb_tconst)]
TitleAKA.to_csv(os.path.join(save_path, 'TitleAKA.csv.gz'), compression='gzip')

In [31]:
TitleAKA.head()

,idTitleAKA,titleID,ordering,title,region,language,isOriginalTitle
0,0,tt0000001,1,Карменсіта,UA,,False
1,1,tt0000001,2,Carmencita,DE,,False
2,2,tt0000001,3,Carmencita - spanyol tánc,HU,,False
3,3,tt0000001,4,Καρμενσίτα,GR,,False
4,4,tt0000001,5,Карменсита,RU,,False

#### Table: TitleRatings

To make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
#replace all the /N into np.nan
TitleRating = Rating.replace({r'\\N': np.nan}, regex=True)
#rename the columns
TitleRating = TitleRating.rename(columns={'tconst':'tr_tconst'})
#froeign key check
#remove the rows do not contains in the primary table TitleBasics
TitleRating = TitleRating.loc[TitleRating.tr_tconst.isin(TitleBasics.tb_tconst)]
TitleRating.to_csv(os.path.join(save_path, 'TitleRating.csv.gz'),  compression='gzip')

In [33]:
TitleRating.head()

   tr_tconst  averageRating  numVotes
0  tt0000001            5.6      1655
1  tt0000002            6.1       199
2  tt0000003            6.5      1366
3  tt0000004            6.2       121
4  tt0000005            6.2      2150

#### Table: KnownForTitles

This dataset comes from original "NameBasic" datasets, the person might have multiple masterpieces, to map this one-to-many relationship, we use flatten function to transfer it into "KnownForTitles" dataset, each row represents the relationship between one person and one of his/her masterpiece. To make sure the dataframe can be read successfully into MySQL database, all the empty column is transferred into np.nan, and the name and order for each column should be same as what we give while creating tables in database.

In [ ]:
known_for_titles_df = flatten_columns(name_basic, 'knownForTitles', 'nconst', 'kt_tconst', 'kt_nconst')
#change the order
KnownForTitles = known_for_titles_df[['nconst','kt_nconst','kt_tconst']]
#rename the columns
KnownForTitles = KnownForTitles.rename(columns={'nconst':'idNameTitle','kt_nconst':'kt_nconst','kt_tconst':'kt_tconst'})
#replace all the /N into np.nan
KnownForTitles = KnownForTitles.replace({r'\\N': np.nan}, regex=True)
#make the first id column to be integer
KnownForTitles['idNameTitle'] = KnownForTitles['idNameTitle'].round(0).astype(int)
KnownForTitles.to_csv('KnownForTitles.csv.gz',  compression='gzip')

In [36]:
KnownForTitles.head()

   idNameTitle  kt_nconst  kt_tconst
0            0  nm0000001  tt0050419
1            1  nm0000001  tt0031983
2            2  nm0000001  tt0072308
3            3  nm0000001  tt0053137
4            4  nm0000002  tt0037382

### 4.3  Load processed tables to database

In [ ]:
for table_name in TABLES:
    table_description = TABLES[table_name]
    try:
        print("Creating table {}: ".format(table_name), end='')
        db_cursor.execute(table_description)
    except mysql.connector.Error as err:
        if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
            print("already exists.")
        else:
            print(err.msg)
    else:
        print("OK")

In [ ]:
db_cursor.execute("SHOW TABLES")
for table in db_cursor:
	print(table)

In [ ]:
# diaable the foreign key check to avoid errors during loading data
db_cursor.execute("SET GLOBAL FOREIGN_KEY_CHECKS=0")

In [ ]:
#write the TitleBasic dataframe into related table
TitleBasic.to_sql('TitleBasics', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the NameBasics dataframe into related table
NameBasics.to_sql('NameBasics', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the TitlePrincipals dataframe into related table
TitlePrincipals.to_sql('TitlePrincipals', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the TitleEposide dataframe into related table
TitleEpisode.to_sql('TitleEpisode', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the TitleAKA dataframe into related table
TitleAKA.to_sql('TitleAKA', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the TitleRating dataframe into related table
TitleRating.to_sql('TitleRating', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the TitleAkaAttribute dataframe into related table
TitleAkaAttribute.to_sql('TitleAkaAttribute', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the TitleCrewDirector dataframe into related table
TitleCrewDirector.to_sql('TitleCrewDirector', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the TitleCrewWriter dataframe into related table
TitleCrewWriter.to_sql('TitleCrewWriter', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the KnownForTitles dataframe into related table
KnownForTitles.to_sql('KnownForTitles', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the TitleAkaType dataframe into related table
TitleAkaType.to_sql('TitleAkaType', con = engine, if_exists = 'append',index=False, chunksize=10000)
#write the PrincipalsCharacters dataframe into related table
PrincipalsCharacters.to_sql('PrincipalsCharacters', con = engine, if_exists = 'append',index=False, chunksize=10000)

## Task 5 Update calculated columns
After loading the data, execute UPDATE statements for the two newly created columns in (2C). You may interpret what appearing in movies means and what you classify as movies -- just make it clear in your notebook.

In [ ]:
##UPDATE AGE
#change the type of birthyear to int
db_cursor.execute('ALTER TABLE NameBasics MODIFY COLUMN birthYear INT null;')

#update the age by the calculated value with current year
db_cursor.execute('SET SQL_SAFE_UPDATES = 0; UPDATE NameBasics SET age = YEAR(CURDATE()) - birthYear;')

We define the appearing in movies as following: if one person is the principals of the movie, he/she will be considered as apearing in the moview.
<br>
We define the movie as following: if one title do not has episode, we condsider it as a movie. In that case, the movie will be have a title which will not show in Title Episode table.

In [ ]:
##UPDATE MOVIES
#To save the time, we create a temproty table for saving the joint table including rows included in TitlePrincipals and not included in TitleEpisode
db_cursor.execute("""CREATE TEMPORARY TABLE IF NOT EXISTS onlyMovie AS (
                     SELECT * FROM TitlePrincipals
                     LEFT JOIN TitleEpisode ON TitleEpisode.te_tconst = TitlePrincipals.tp_tconst
                     WHERE TitleEpisode.te_tconst IS NULL)""")

#calculate number of movies by counting the rows in the temperoty table
db_cursor.execute("""UPDATE NameBasics SET numberOfMovies = (SELECT COUNT(*) FROM onlyMovie WHERE onlyMovie.tp_nconst = NameBasics.nb_nconst);""")

![Result of adding two calculated columns](pics\task5.png)

## Task 6 Add Triggers
Add triggers to the appropriate tables so that the newly created columns in (2C) are automatically updated when new data in inserted.

Add Triggers for Age: Similar to the calcualted colum, it will calculate a value before a new item inserted into a the table

In [ ]:
#ONLY run the trigger if the age is not given
age_trigger_sql="""DELIMITER $$
CREATE
    TRIGGER age_calculation AFTER INSERT 
    ON NameBasics
    FOR EACH ROW BEGIN

        update NameBasics
        set NameBasics.age = YEAR(CURDATE()) - NEW.birthYear
        where NameBasics.nb_nconst = NEW.nb_nconst;

    END$$
DELIMITER ;"""

db_cursor.execute(age_trigger_sql)

![Result of adding two triggers shown in MySQL workbench](pics\age_trigger.png)

Add Triggers for number of movies: Similar to the calcualted colum, it will calculate a value before a new item inserted into a the table

In [ ]:
#SIMILAR BUT ADD DELIMITER
movie_trigger_sql ="""delimiter $$
                      CREATE TRIGGER numberOfMovies_calculation
                      before INSERT
                      ON NameBasics
                      FOR EACH ROW
                        UPDATE NameBasics
                        SET NameBasics.numberOfMovies = ( with tp_groupby as ( SELECT tp_nconst, COUNT(distinct tp_tconst) as n_movies 
                        FROM TitlePrincipals 
                        where tp_tconst not in (select te_tconst from TitleEpisode) 
                        group by tp_nconst)
                        select tp_groupby.n_movies from tp_groupby
                        where tp_groupby.tp_nconst = NameBasics.nb_nconst); 
                      END$$"""

db_cursor.execute(movie_trigger_sql)

![Result of adding two triggers shown in MySQL workbench](pics\movie_trigger.png)

## Task 7 Create a view
 Create a view that lists the name of each actor, their age, whether they are dead or not, and how many movies they are known for.

In [ ]:
create_sql="""CREATE OR REPLACE VIEW actors AS
              With NumKnowFor AS (Select kt_nconst, count(*) as n_kf from KnownForTitles group by kt_nconst) 
              SELECT distinct nb.nb_nconst, nb.primaryName, nb.age, (nb.deathYear is not null) as deadorNot, NumKnowFor.n_kf as numKnownForTitle 
              FROM NameBasics nb
              Join NumKnowFor on NumKnowFor.kt_nconst=nb.nb_nconst
              Join (Select distinct tp_nconst FROM TitlePrincipals Where TitlePrincipals.category = 'actor') AS tt 
              ON tt.tp_nconst = nb.nb_nconst;"""

db_cursor.execute(create_sql)

db_cursor.execute("""select * from actors limit 10""")
db_cursor.fetchall()

![First 10 samples of created actors view](pics\task7.png)

## Task 8 Finds the number of seasons for each TV series and Plot Histogram
Write a query that finds the number of seasons for each TV series. Using the results of the query create a histogram (frequency plot).

In [ ]:
n_season_sql = """ SELECT titlebasics.primaryTitle, parentTconst, max(seasonNumber) as n_seasons 
from TitleEpisode 
join TitleBasics on TitleBasics.tb_tconst = TitleEpisode.te_tconst 
WHERE seasonNumber IS NOT NULL GROUP BY parentTconst; """

n_seasons_df = pd.read_sql(n_season_sql, con = engine)
n_seasons_df.head(5)

![First 5 samples of queried result ](pics\task8_df.png)

In [ ]:
df = n_seasons_df.copy()
ax =df.plot.hist(by = 'n_seasons', bins=100)
ax.title('Histogram for all TV series')
df = df.loc[df.n_seasons < 100]
ax =df.plot.hist(by = 'n_seasons', bins=100)
ax.title('Histogram for TV series which season number is less than 100')

![Histogram for all TV series](pics\task8_whole.png)
![Histogram for TV series which has season number is less than 100 for detailed look](pics\task8_whole.png)

## Task 9 Build a function to add actors
Build a function in your code or a stored procedure in the database (approach is your choice) called addActor() that adds a new actor to the database: this requires updating several tables, so the insertions must occur within a transaction in order to function properly in a concurrent environment. Test your function by inserting a new actor -- you may make up a name and associated information. Show evidence  in your notebook that the actor was properly inserted.

Add an actor will make changes to those three tables: NameBasics table by adding a person information, TitlePrincipals by adding a category associated with a title(movie or tv, etc), KnownForTitle table by having the titles that this actor are known for. 
<br>
In summary, an actor should have following attributes: nconst, tconst, ordering and principals. We assume that the actor added is already existed in the NameBasics and the tconst is already exist into TitleBasics too.

As we stated, we assume an actor exists in name basic table. If not, there is an extra step to add person in Name Basic, which is out of our consideration. Then for a person in Name Basics, we add an actor by asscosiating it with a production title(movie, TV, etc) and some characters in the production. For example, we have a person(nm0000001) which plays roles as Elizabeth, Queen, Layard in a title(tt0000050). So we can see that before adding this actor, the numer of movies of this person is 139.
<br>
![Table Name basic before adding actors ](pics\figure_Taks9\NameBasics_before.png)
<br>
<br>
After adding this actor, the numer of movies of this person becomes 140. Principal characters table is also updated. Three defined characters are shown as below. More over, we can directly query actor information related to this title in Title Principals table 
<br>
<br>
![Table Name basic after adding actors ](pics\figure_Taks9\NameBasics_After.png)
<br>
![Table Title Characters after adding actors ](pics\figure_Taks9\PrincipalCharacters.png)
<br>
![Table Title Principal after adding actors ](pics\figure_Taks9\TitlePrincipals2.png)

In [ ]:
db_connection.autocommit = True

def addActor(nconst, tconst, ordering, principals):
    #get the max index for current table and the newidex=max(index+1)
    db_cursor.execute('SELECT MAX(idTitlePrincipals) FROM TitlePrincipals')
    max_idTitlePrincipals = db_cursor.fetchone()
    new_idTitlePrincipals = max_idTitlePrincipals[0]+1
    db_cursor.execute('INSERT IGNORE INTO TitlePrincipals(idTitlePrincipals, tp_tconst, tp_ordering, tp_nconst, category) VALUES (%s,%s,%s,%s,%s)',(new_idTitlePrincipals, tconst, ordering, nconst, 'actor'))
    #SEPERATE THE PRINCIPALS IF IT HAS MULTIPLE PRINCIPALS
    roles = str.split(principals,',')
    db_cursor.execute('SELECT MAX(idPrincipalsCharacters) FROM PrincipalsCharacters')
    max_idPrincipalsCharacters = db_cursor.fetchone()
    max_idPrincipalsCharacters = max_idPrincipalsCharacters[0]
    #insert each principal of this new record as a new row
    i=0
    while i < len(roles):
        max_idPrincipalsCharacters = max_idPrincipalsCharacters+i+1
        db_cursor.execute('INSERT IGNORE INTO PrincipalsCharacters(idPrincipalsCharacters, pc_idTitlePrincipals, `character`) VALUES (%s,%s,%s)',(max_idPrincipalsCharacters,new_idTitlePrincipals,roles[i])) 
        i+=1
    #check whether the tconst is a movie or not, if is the movie, then update the numOfMovies = numOfMovies + 1
    db_cursor.execute("SELECT count(*) FROM TitleEpisode WHERE te_tconst = %s or parentTconst = %s",(tconst,tconst))
    numEp = db_cursor.fetchone()
    numEp = numEp[0]
    if numEp < 1: 
        db_cursor.execute('UPDATE NameBasics SET numberOfMovies = numberOfMovies+1 WHERE nb_nconst =%s', (nconst,))      
     return ("Insert Successfully")

In [ ]:
#test example:
addActor('nm0000001', 'tt0000050', 1, 'Elizabeth, Queen, Layard')

#check the result:
db_cursor.execute("SELECT * FROM TitlePrincipals WHERE tp_nconst = 'nm0000001' AND tp_tconst = 'tt0000050'")
db_cursor.fetchall()

db_cursor.execute("SELECT * FROM PrincipalsCharacters WHERE pc_idTitlePrincipals = 41693055'")
db_cursor.fetchall()

## Task 10 Build a function to delete actors
Build a function in your code or a stored procedure in the database (approach is your choice) called deleteActor() that removes an actor from the database: this requires updating several tables, so the deletions must occur within a transaction in order to function properly in a concurrent environment. Test your function by deleting a new actor inserted in (9) -- show evidence that the removal was successful.

Similarly, deleting an actor will affect those three tables. It is basically remove the relationship between person and title. Here we will delete the actor (nm0617588) from a title (tt0000417). Before we delete it, in Table Name basic, the number of movies the person appears is 545. We can also find this actor in Principal characters table and title principals table.
<br>
![Table Name basic before deleting actors ](pics\figure_task10\NameBasics_before.png)
<br>

![Table Title Characters after deleting actors ](pics\figure_task10\PrincipalCharacters_before.png)
<br>
![Table Title Principal after deleting actors ](pics\figure_task10\TitlePrincipals_before.png)
<br>
<br>
After deleting this actor, the numer of movies of this person becomes 544, indicating the record is deleted. Principal characters table and title principals table are also updated. We cannot get query result out of table.
<br>
<br>
![Table Name basic after adding actors ](pics\figure_task10\NameBasics_After.png)
<br>

In [ ]:
db_connection.autocommit = True
def deleteActor(nconst, tconst, ordering):
    #find the idTitlePrincipals for row to be deleted
    db_cursor.execute("SELECT idTitlePrincipals FROM TitlePrincipals WHERE tp_tconst = %s AND tp_ordering=%s AND tp_nconst = %s AND category = 'actor'",(tconst, ordering, nconst))
    find_idTitlePrincipals = db_cursor.fetchone()
    find_idTitlePrincipals = find_idTitlePrincipals[0]
    #delete the row from the TitlePrincipals
    db_cursor.execute("DELETE FROM TitlePrincipals WHERE idTitlePrincipals = %s",(find_idTitlePrincipals,))
    #delete the row from the PrincipalsCharacters
    db_cursor.execute("DELETE FROM PrincipalsCharacters WHERE pc_idTitlePrincipals = %s",(find_idTitlePrincipals,))
    #check whether the tconst is a movie or not, if is the movie, then update the numOfMovies = numOfMovies - 1
    db_cursor.execute("SELECT count(*) FROM TitleEpisode WHERE te_tconst = %s or parentTconst = %s",(tconst,tconst))
    numEp = db_cursor.fetchone()
    numEp = numEp[0]
    if numEp < 1: 
        db_cursor.execute('UPDATE NameBasics SET numberOfMovies = numberOfMovies-1 WHERE nb_nconst =%s', (nconst,))
    return ("Delete Successfully")

In [ ]:
#test example:
deleteActor('nm0617588', 'tt0000417',1)

#check the result:
db_cursor.execute("SELECT * FROM TitlePrincipals WHERE tp_nconst = 'nm0617588' AND tp_tconst = 'tt0000417'")
db_cursor.fetchall()

db_cursor.execute("SELECT * FROM NameBasics WHERE nb_nconst = 'nm0617588'")
db_cursor.fetchall()

## Task 11 Query actors
Write a query to retrieve the names and ages of all actors who appeared in more than two movies (but not TV series) which an above average rating. Show the results of the query in your notebook.

In this task, we first calculatet the average rating of all movies and then use calculated number to further select the actors which appeared in more than two movies has an above average rating.

In [ ]:
#calculate the total average rating 
db_cursor.execute("""SELECT avg(averageRating)'totalavg' FROM TitleRating 
                    where tp_tconst not in (select te_tconst from TitleEpisode) """)
totalavg = db_cursor.fetchone()
totalavg = max_idTitlePrincipals[0]
#output the actors with more than 2 movies having above average ratings (rating > average rating)
db_cursor.execute("""SELECT primaryName, age FROM NameBasics 
                     LEFT JOIN TitlePrincipals ON TitlePrincipals.tp_nconst = NameBasics.nb_nconst
                     LEFT JOIN TiTleRating ON TitleRating.tr_tconst = TitlePrincipals.tp_tconst
                     WHERE TitleRating.averageRating > %s AND TiTleRating.tr_tconst not in (select te_tconst from TitleEpisode AND category = category = 'actor')
                     GROUP BY primaryName
                     HAVING count(primaryName)>2""",(totalavg,))

## Task 12 Index
Write a query that finds an actor by name (pick a name). Measure the execution time of the query. Then create an index that would improve the performance of the query and then run and measure it again. Show the difference and comment on why that's the case.

From the excutation time and the rows shown in the plots, we can tell the query is not efficiency. From figure explain analyze result, we can see the process takes more than 1048260 seconds to query this information. From figure explain result we can see it used huge number of rows when querying one result.
<br>

![Explain the query result before adding index](pics\figure_task12\12_original_no_analyze.png)


![Explain analyze the query result before adding index](pics\figure_task12\12_oringinal_analyze.png)

In [ ]:
db_cursor.execute(" EXPLAIN select primaryName from actors where primaryName='Fred Astraire'; ")
analyze_fetched = db_cursor.fetchall()

In [ ]:
analyze_fetched = db_cursor.fetchall()

In [ ]:
db_cursor.execute(" EXPLAIN ANALYZE select primaryName from actors where primaryName='Fred Astraire'; ")
analyze_fetched = db_cursor.fetchall()

So the performance should be improved by adding a index. However based on our research, MySQL did not support the index feature for view table as stated in http://dev.mysql.com/doc/refman/5.7/en/view-restrictions.html
<br>
View processing is not optimized:

1. It is not possible to create an index on a view.

2. Indexes can be used for views processed using the merge algorithm. However, a view that is processed with the temptable algorithm is unable to take advantage of indexes on its underlying tables (although indexes can be used during generation of the temporary tables).
<br>
We also tried to add an index to a view but get an error "Error Code: 1347. 'practicum2.actors' is not BASE TABLE"
<br>
So we found a workaround inspired by https://stackoverflow.com/questions/38391726/mysql-index-on-view-not-working to create a well-indexed table and then improve our performance based on new tables. 

The steps we achieve it are:
1. Create a table according to my needs, having the exact same structure as the view, 
2. running a sql to insert rows of view into new table
3. Add a index for primaryName 

By having a well-indexed table, we can largely increase the performance. Note that this table will not updated with raw data table. 
<br>
From the explain and explain analyze result, we can see only one row is used in query and it takes only 1.1 seconds which is impressive.

![Explain the query result after adding index](pics\figure_task12\12_no_analyze.png)
<br>
![Explain analyze the query result after adding index](pics\figure_task12\12_explain.png)

In [ ]:
create_index_sql =""" create table actorsView (nb_nconst varchar(500),
primaryName varchar(500),
age int,
deadorNot int,
numKnownForTitle bigint
);
TRUNCATE actorsView; 
INSERT INTO actorsView SELECT * FROM actors;
ALTER TABLE actorsView ADD INDEX idx_primaryName(primaryName);
"""

In [ ]:
db_cursor.execute(" EXPLAIN select primaryName from actors where primaryName='Fred Astraire'; ")
analyze_fetched = db_cursor.fetchall()

In [ ]:
db_cursor.execute(" EXPLAIN ANALYZE select primaryName from actors where primaryName='Fred Astraire'; ")
analyze_fetched = db_cursor.fetchall()